<h1>Data Analysis With Python</h1>

<h3>Importing Pandas and Loading Data</h3>

In [1]:
import pandas as pd

path = 'https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/master/warmup-data/coffee.csv'

<h4>Reading Files into Variables to Work as a Dataframe</h4>

In [2]:
df = pd.read_csv(path)
df

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [3]:
df.head() #Accesing the first 5 rows of the df

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [4]:
df.tail() #Accesing the last 5 rows of the df

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [5]:
df.sample(10) #Accesing a random sample of the df

          Day Coffee Type  Units Sold
12     Sunday    Espresso          45
8      Friday    Espresso          45
2     Tuesday    Espresso          30
6    Thursday    Espresso          40
10   Saturday    Espresso          45
3     Tuesday       Latte          20
1      Monday       Latte          15
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
7    Thursday       Latte          30

<h4>Using loc e iloc

In [6]:
df.loc[0] #Brings the row on the dataframe

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [7]:
df.loc[[0,1,2]] #Brings the specified rows on the dataframe

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [8]:
df.loc[5:8] # Accepts slice notation to bring diferent rows

         Day Coffee Type  Units Sold
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30
8     Friday    Espresso          45

In [9]:
df.loc[5:8, ['Coffee Type']] # After the comma is the declaration of the column to access

  Coffee Type
5       Latte
6    Espresso
7       Latte
8    Espresso

In [10]:
df.loc[0, ['Day','Units Sold' ]] # Access to multiple columns in the bracket notation

Day           Monday
Units Sold        25
Name: 0, dtype: object

In [11]:
df.iloc[:, [0,2]] # Works just like loc but uses the index instead of the names of columns
# The : brings all the rows. Same slice notation can be used in the columns

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

<h3> Accessing Columns

In [12]:
df.Day #With single name columns is possible to use . notation

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [13]:
df['Units Sold'] #With multiple words columns use bracket notation

0     25
1     15
2     30
3     20
4     35
5     25
6     40
7     30
8     45
9     35
10    45
11    35
12    45
13    35
Name: Units Sold, dtype: int64

In [14]:
df.sort_values(['Units Sold'], ascending=False) #Order the values in ascending by default. Use False to descending order

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [15]:
df.sort_values(['Units Sold', 'Day'], ascending=[0,1]) 
#To sort multiple columns uses bracket notation with 0 to False (descending) and 1 to True (ascending)

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
4   Wednesday    Espresso          35
7    Thursday       Latte          30
2     Tuesday    Espresso          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

<h3>Filtering Data

In [17]:
df[(df['Units Sold'] > 30)]

          Day Coffee Type  Units Sold
4   Wednesday    Espresso          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [20]:
df[(df['Units Sold'] > 30) & (df['Coffee Type'] == 'Espresso')]

          Day Coffee Type  Units Sold
4   Wednesday    Espresso          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [23]:
df[(df['Units Sold'] > 30) & (df['Coffee Type'] == 'Espresso')].sort_values('Day')
#Same operation but showing the values sorted by Day alphabeticaly

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35

In [30]:
df[df['Day'].isin(['Sunday'])] #Uses 'isin' to filter by content

       Day Coffee Type  Units Sold
12  Sunday    Espresso          45
13  Sunday       Latte          35

In [27]:
# The function 'isin' can pass multiple values
df[(df['Day'].isin(['Friday', 'Saturday', 'Sunday'])) & (df['Units Sold'] > 30)]

         Day Coffee Type  Units Sold
8     Friday    Espresso          45
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [31]:
df[df['Day'].str.startswith('Sun')] #Filtering by part of the content

       Day Coffee Type  Units Sold
12  Sunday    Espresso          45
13  Sunday       Latte          35

In [35]:
df.query('Day == "Wednesday"') #Filtering using specific data in a specific column

         Day Coffee Type  Units Sold
4  Wednesday    Espresso          35
5  Wednesday       Latte          25

<h3> Adding/Removing Columns

In [43]:
import numpy as np

In [45]:
new_df = df.copy() 
# Creates a copy of the dataframe. 
# Just assigning a new variable will create a pointer to the old variable altering its value

In [46]:
new_df

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [48]:
new_df['price'] = 4.99 # Creates a column and assign the values to this column

In [49]:
new_df

          Day Coffee Type  Units Sold  price
0      Monday    Espresso          25   4.99
1      Monday       Latte          15   4.99
2     Tuesday    Espresso          30   4.99
3     Tuesday       Latte          20   4.99
4   Wednesday    Espresso          35   4.99
5   Wednesday       Latte          25   4.99
6    Thursday    Espresso          40   4.99
7    Thursday       Latte          30   4.99
8      Friday    Espresso          45   4.99
9      Friday       Latte          35   4.99
10   Saturday    Espresso          45   4.99
11   Saturday       Latte          35   4.99
12     Sunday    Espresso          45   4.99
13     Sunday       Latte          35   4.99

In [50]:
new_df['new_price'] = np.where(new_df['Coffee Type'] == 'Espresso', 3.99, 5.99)
# Creates a new column 'new_price' 
# no where function identifies a field and makes a comparison, assign 1 value to column that matches and 2 to rest

In [51]:
new_df

          Day Coffee Type  Units Sold  price  new_price
0      Monday    Espresso          25   4.99       3.99
1      Monday       Latte          15   4.99       5.99
2     Tuesday    Espresso          30   4.99       3.99
3     Tuesday       Latte          20   4.99       5.99
4   Wednesday    Espresso          35   4.99       3.99
5   Wednesday       Latte          25   4.99       5.99
6    Thursday    Espresso          40   4.99       3.99
7    Thursday       Latte          30   4.99       5.99
8      Friday    Espresso          45   4.99       3.99
9      Friday       Latte          35   4.99       5.99
10   Saturday    Espresso          45   4.99       3.99
11   Saturday       Latte          35   4.99       5.99
12     Sunday    Espresso          45   4.99       3.99
13     Sunday       Latte          35   4.99       5.99

In [53]:
new_df.drop(columns=['price']) # Show the data frame without the droped column
# To assign this as the new data frame use 'inplace = True' or reassign the variable

#new_df.drop(columns=['price'], inplace=True)
#new_df = new_df.drop(columns=['price'])

          Day Coffee Type  Units Sold  new_price
0      Monday    Espresso          25       3.99
1      Monday       Latte          15       5.99
2     Tuesday    Espresso          30       3.99
3     Tuesday       Latte          20       5.99
4   Wednesday    Espresso          35       3.99
5   Wednesday       Latte          25       5.99
6    Thursday    Espresso          40       3.99
7    Thursday       Latte          30       5.99
8      Friday    Espresso          45       3.99
9      Friday       Latte          35       5.99
10   Saturday    Espresso          45       3.99
11   Saturday       Latte          35       5.99
12     Sunday    Espresso          45       3.99
13     Sunday       Latte          35       5.99

In [54]:
new_df

          Day Coffee Type  Units Sold  price  new_price
0      Monday    Espresso          25   4.99       3.99
1      Monday       Latte          15   4.99       5.99
2     Tuesday    Espresso          30   4.99       3.99
3     Tuesday       Latte          20   4.99       5.99
4   Wednesday    Espresso          35   4.99       3.99
5   Wednesday       Latte          25   4.99       5.99
6    Thursday    Espresso          40   4.99       3.99
7    Thursday       Latte          30   4.99       5.99
8      Friday    Espresso          45   4.99       3.99
9      Friday       Latte          35   4.99       5.99
10   Saturday    Espresso          45   4.99       3.99
11   Saturday       Latte          35   4.99       5.99
12     Sunday    Espresso          45   4.99       3.99
13     Sunday       Latte          35   4.99       5.99

In [55]:
new_df['revenue'] = new_df['Units Sold'] * new_df['new_price']
# Creates a column revenue with its values being calculated by the values in other columns

In [56]:
new_df.head()

         Day Coffee Type  Units Sold  price  new_price  revenue
0     Monday    Espresso          25   4.99       3.99    99.75
1     Monday       Latte          15   4.99       5.99    89.85
2    Tuesday    Espresso          30   4.99       3.99   119.70
3    Tuesday       Latte          20   4.99       5.99   119.80
4  Wednesday    Espresso          35   4.99       3.99   139.65

In [58]:
new_df.rename(columns={'price':'old_price'})
# This also just shows the values, to alter use inplace or reasign the variable

          Day Coffee Type  Units Sold  old_price  new_price  revenue
0      Monday    Espresso          25       4.99       3.99    99.75
1      Monday       Latte          15       4.99       5.99    89.85
2     Tuesday    Espresso          30       4.99       3.99   119.70
3     Tuesday       Latte          20       4.99       5.99   119.80
4   Wednesday    Espresso          35       4.99       3.99   139.65
5   Wednesday       Latte          25       4.99       5.99   149.75
6    Thursday    Espresso          40       4.99       3.99   159.60
7    Thursday       Latte          30       4.99       5.99   179.70
8      Friday    Espresso          45       4.99       3.99   179.55
9      Friday       Latte          35       4.99       5.99   209.65
10   Saturday    Espresso          45       4.99       3.99   179.55
11   Saturday       Latte          35       4.99       5.99   209.65
12     Sunday    Espresso          45       4.99       3.99   179.55
13     Sunday       Latte          35       4.99       5.99   209.65

In [60]:
new_df['cost'] = new_df['new_price'].apply(lambda x: 'Expensive' if x > 4.99 else 'Cheap')
# Creates a column where the value is created by a custom function

In [61]:
new_df

          Day Coffee Type  Units Sold  price  new_price  revenue       cost
0      Monday    Espresso          25   4.99       3.99    99.75      Cheap
1      Monday       Latte          15   4.99       5.99    89.85  Expensive
2     Tuesday    Espresso          30   4.99       3.99   119.70      Cheap
3     Tuesday       Latte          20   4.99       5.99   119.80  Expensive
4   Wednesday    Espresso          35   4.99       3.99   139.65      Cheap
5   Wednesday       Latte          25   4.99       5.99   149.75  Expensive
6    Thursday    Espresso          40   4.99       3.99   159.60      Cheap
7    Thursday       Latte          30   4.99       5.99   179.70  Expensive
8      Friday    Espresso          45   4.99       3.99   179.55      Cheap
9      Friday       Latte          35   4.99       5.99   209.65  Expensive
10   Saturday    Espresso          45   4.99       3.99   179.55      Cheap
11   Saturday       Latte          35   4.99       5.99   209.65  Expensive
12     Sunday    Espresso          45   4.99       3.99   179.55      Cheap
13     Sunday       Latte          35   4.99       5.99   209.65  Expensive

<h3>Merging and Concatenating Data

In [64]:
first_df = pd.DataFrame(
    [['Ana', 'Banana', 'Icecream'], ['Bob', 'Grape', 'Cake'],['Charlie', 'Orange', 'Cookies']],
    columns = ['Name', 'Fruit', 'Dessert'])

first_df

      Name   Fruit   Dessert
0      Ana  Banana  Icecream
1      Bob   Grape      Cake
2  Charlie  Orange   Cookies

In [65]:
second_df = pd.DataFrame(
    [['Ana', 32, 'Female'], ['Bob', 16, 'Male'],['Charlie', 25, '']],
    columns = ['Name', 'Age', 'Gender'])

second_df

      Name  Age  Gender
0      Ana   32  Female
1      Bob   16    Male
2  Charlie   25

In [68]:
third_df = pd.DataFrame(
    [['Dan', 'Strawberry', 'Cookies'], ['Evan', 'Banana', 'Icecream'],['Fanny', 'Grape', 'Icecream']],
    columns = ['Name', 'Fruit', 'Dessert'])

third_df

    Name       Fruit   Dessert
0    Dan  Strawberry   Cookies
1   Evan      Banana  Icecream
2  Fanny       Grape  Icecream

In [66]:
combined_df = pd.merge(first_df, second_df, on='Name', how='inner')
# Connects to dataframes (Default 'inner') like a JOIN in SQL

In [67]:
combined_df

      Name   Fruit   Dessert  Age  Gender
0      Ana  Banana  Icecream   32  Female
1      Bob   Grape      Cake   16    Male
2  Charlie  Orange   Cookies   25

In [69]:
full_df = pd.concat([first_df, third_df])
# Concatenates a list of dataframes one on top of the other. Like a UNION in SQL

In [70]:
full_df

      Name       Fruit   Dessert
0      Ana      Banana  Icecream
1      Bob       Grape      Cake
2  Charlie      Orange   Cookies
0      Dan  Strawberry   Cookies
1     Evan      Banana  Icecream
2    Fanny       Grape  Icecream